Дипломная_работа/src/InformationRegisters/ВКМ_ОчередьУведомлений/ВКМ_ОчередьУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ОчередьУведомлений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЧата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дипломная_работа/src/CommonModules/ВКМ_ТелеграмСервер/Module.bsl
Процедура ОтправитьУведомления() Экспорт

	// 1. Выбираем только те записи, которые еще не были отправлены
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Очередь.Период КАК Период,
		|	Очередь.ТекстСообщения КАК ТекстСообщения,
		|	Очередь.ИдентификаторЧата КАК ИдентификаторЧата
		|ИЗ
		|	РегистрСведений.ВКМ_ОчередьУведомлений КАК Очередь
		|ГДЕ
		|	Очередь.Отправлено = ЛОЖЬ";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		Попытка
			// Пытаемся отправить
			Результат = ОтправитьСообщениеВТелеграм(Выборка.ИдентификаторЧата, Выборка.ТекстСообщения);
			
			Если Результат Тогда
				// 2. Если успешно — помечаем запись в регистре
				МенеджерЗаписи = РегистрыСведений.ВКМ_ОчередьУведомлений.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = Выборка.Период;
				МенеджерЗаписи.ТекстСообщения = Выборка.ТекстСообщения;
				
				МенеджерЗаписи.Прочитать();
				Если МенеджерЗаписи.Выбран() Тогда
					МенеджерЗаписи.Отправлено = Истина;
					МенеджерЗаписи.Записать();
				КонецЕсли;
			КонецЕсли;
		Исключение
			ЗаписьЖурналаРегистрации("ВКМ_Телеграм", УровеньЖурналаРегистрации.Ошибка, , , 
				"Ошибка при отправке сообщения: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

// Функция HTTP-запроса к API Telegram
Функция ОтправитьСообщениеВТелеграм(ЧатID, Текст)
	
	// Замени на актуальный токен твоего бота
	Токен = "0000000000:AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA"; 
	
	// Формируем ресурс. Текст нужно кодировать для URL, если в нем есть спецсимволы
	ТекстДляURL = КодироватьСтроку(Текст, СпособКодированияСтроки.URLКодирование);
	Ресурс = "bot" + Токен + "/sendMessage?chat_id=" + СтрЗаменить(Формат(ЧатID, "ЧГ=0"), " ", "") + "&text=" + ТекстДляURL;
	
	Попытка
		// Используем защищенное соединение для https://api.telegram.org
		Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , 10, Новый ЗащищенноеСоединениеOpenSSL());
		Запрос = Новый HTTPЗапрос(Ресурс);
		Ответ = Соединение.Получить(Запрос);
		
		Возврат (Ответ.КодСостояния = 200);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции
